Natural_Reef_CFD/highRelief/Scenario_37/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          78;
        startFace       422428;
    }
    outlet
    {
        type            patch;
        nFaces          77;
        startFace       422506;
    }
    atmosphere
    {
        type            patch;
        nFaces          460;
        startFace       422583;
    }
    bathymetry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1774;
        startFace       423043;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          422620;
        startFace       424817;
    }
)

// ************************************************************************* //
